app/controllers/account_controller.rb

SELECT count(*) AS count_all FROM `users`
---
  def index
    redirect_to(:action => 'signup') unless logged_in? || User.count > 0

INSERT INTO `users` (`salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `remember_token`, `login`, `email`, `created_at`) VALUES('d1fdabbf41cb494a410b1a6a7d8dc15801569912', '2010-06-14 05:58:11', NULL, 'b344c778aa84bf68dbd830bb9e621871875b8028', NULL, NULL, NULL, 'ravi', 'ravikumawat87@gmail.com', '2010-06-14 05:58:11')
---
  def signup
     @user = User.new(params[:user])
     return unless request.post?
     @user.save!

SELECT * FROM `users` WHERE (`users`.`activation_code` IS NULL) LIMIT 1
---
  def activate
    @user = User.find_by_activation_code(params[:id])