app/controllers/task_controller.rb

def create
@task = current_user.tasks.build(params[:task])
if @task.save!
---
INSERT INTO `tasks` (`name`, `created_on`, `updated_at`, `updated_on`, `complete`, `user_id`, `due`, `created_at`) VALUES('hgh', '2010-06-14 10:08:52', '2010-06-14 10:08:52', '2010-06-14 10:08:52', NULL, 1, NULL, '2010-06-14 10:08:52')

def update
 @task.attributes = params[:task]
 @task.save!
---
UPDATE `tasks` SET `updated_on` = '2010-06-17 10:24:42', `updated_at` = '2010-06-17 10:24:42', `name` = 'daily task' WHERE `id` = 41

def destroy
@task.destroy
---
DELETE FROM `tasks` WHERE `id` = 29

def mark_complete
if @task.complete.nil?
@task.complete = Time.now
@task.todo.move_to_bottom
else
@task.complete = nil
end
@task.save!
---
UPDATE `tasks` SET `complete` = '2010-06-17 07:12:20', `updated_on` = '2010-06-17 07:12:21', `updated_at` = '2010-06-17 07:12:21' WHERE `id` = 28
UPDATE `todos` SET `position` = 2, `updated_at` = '2010-06-17 07:28:13' WHERE `id` = 1

def find_task()
  @task = current_user.tasks.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 41 AND (`tasks`.user_id = 1))