app/controllers/today_controller.rb

SELECT * FROM `todos` WHERE (`todos`.schedule_id = 1) ORDER BY position
UPDATE `todos` SET `position` = 2, `updated_at` = '2010-06-17 07:26:12' WHERE `id` = 1
---
  def sort
    @today.todos.each do |todo|
    todo.position = params['todo-list'].index(todo.id.to_s) + 1
    todo.save

INSERT INTO `schedules` (`today`, `updated_at`, `user_id`, `created_at`) VALUES('2010-06-18', '2010-06-18 08:55:42', 1, '2010-06-18 08:55:42')
---
def find_schedule
@today = current_user.schedule || current_user.create_schedule(:today => Date.today.to_s)