app/controllers/todo_controller.rb

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 28 AND (`tasks`.user_id = 1))
INSERT INTO `todos` (`updated_at`, `task_id`, `schedule_id`, `position`, `created_at`) VALUES('2010-06-17 06:51:19', 28, 1, 1, '2010-06-17 06:51:19')
---
   task = current_user.tasks.find(params[:id])
   current_user.schedule.todos.create(:task_id => task.id)

SELECT * FROM `todos` WHERE (`todos`.schedule_id = 2) ORDER BY position
DELETE FROM `todos` WHERE `id` = 7
---
  def todo_delete
@todo = Todo.find(params[:id])
current_user.schedule.todos.destroy(@todo)